#include<stdio.h>
#include<stdlib.h>

void FengMian()
{
	printf("\t\t************************************************************************\n");
	printf("\t\t****** ¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x¨x ******\n");
	printf("\t\t****** ¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹¨‹ ******\n");
	printf("\t\t******©§                                                         ©§ ******\n");
	printf("\t\t******©§                   ¡ï¡ï¡ï¡ï¡ï¡ï¡ï¡ï                      ©§ ******\n");
	printf("\t\t******©§                   ¡ï   Ì°³ÔÉß   ¡ï                      ©§ ******\n");
	printf("\t\t******©§                   ¡ï¡ï¡ï¡ï¡ï¡ï¡ï¡ï                      ©§ ******\n");
	printf("\t\t******©§                                                         ©§ ******\n");
	printf("\t\t****** ¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø¡ø ******\n");
	printf("\t\t****** ¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰¨‰ ******\n");
	printf("\t\t************************************************************************\n");
}
int main()
{
	//´òÓ¡·âÃæ
	FengMian(); 
	system("pause");
	return 0;
}